; domain
(define (domain industrial_manufacturing_no_carrier)
    (:requirements :strips :typing)
    (:types 
        location box content agent workstation type - object
    )

    (:predicates
        (connected ?loc1 ?loc2 - location)
        (box_at_loc ?box - box ?loc - location)
        (agent_at_loc ?agent - agent ?loc - location)
        (ws_at_loc ?ws - workstation ?loc - location)
        (content_at_loc ?content - content ?loc - location)
        (is_type ?content - content ?t - type)
        (empty_box ?box - box)
        (filled_box ?box - box ?content - content)
        (box_at_ws ?box - box ?ws - workstation)
        (box_at_agent ?box - box ?agent - agent)
        (content_type_at_ws ?t - type ?ws - workstation)
        (empty_agent ?agent - agent)
    )

    (:action pick_up
        :parameters (?loc - location ?box - box ?agent - agent)
        :precondition (and
            (empty_agent ?agent)
            (agent_at_loc ?agent ?loc)
            (box_at_loc ?box ?loc)
        )
        :effect (and
            (not (empty_agent ?agent))
            (box_at_agent ?box ?agent)
            (not (box_at_loc ?box ?loc))
        )
    )

    (:action move
        :parameters (?from ?to - location ?agent - agent)
        :precondition (and
            (connected ?from ?to)
            (agent_at_loc ?agent ?from)
        )
        :effect (and
            (not (agent_at_loc ?agent ?from))
            (agent_at_loc ?agent ?to)
        )
    )

    (:action deliver 
        :parameters ( 
            ?box - box  
            ?ws - workstation  
            ?location - location  
            ?agent - agent  
        ) 
        :precondition (and 
            (ws_at_loc ?ws ?location) 
            (agent_at_loc ?agent ?location) 
            (box_at_agent ?box ?agent)
        ) 
        :effect (and 
            (not (box_at_agent ?box ?agent)) 
            (empty_agent ?agent)
            (box_at_ws ?box ?ws) 
        ) 
    ) 

    (:action fill 
        :parameters ( 
            ?box - box  
            ?content - content 
            ?loc - location  
            ?agent - agent  
        ) 
        :precondition (and 
            (content_at_loc ?content ?loc) 
            (agent_at_loc ?agent ?loc) 
            (box_at_agent ?box ?agent) 
            (empty_box ?box) 
        ) 
        :effect (and 
            (not (empty_box ?box)) 
            (filled_box ?box ?content) 
            (not (content_at_loc ?content ?loc)) 
        ) 
    ) 

    (:action empty
        :parameters (
            ?box - box 
            ?content - content 
            ?t - type 
            ?ws - workstation 
            ?agent - agent 
            ?loc - location
        )
        :precondition (and
            (is_type ?content ?t)
            (box_at_ws ?box ?ws)
            (ws_at_loc ?ws ?loc)
            (filled_box ?box ?content)
            (agent_at_loc ?agent ?loc)
        )
        :effect (and
            (not (filled_box ?box ?content))
            (empty_box ?box)
            (box_at_loc ?box ?loc)
            (not (box_at_ws ?box ?ws))
            (content_type_at_ws ?t ?ws)
        )
    )
)

; problem
(define (problem instance1) (:domain industrial_manufacturing_no_carrier)  
  (:objects  
    ; define the world 
    cw loc1 loc2 - location  
    ws1 ws2 ws3 ws4 ws5 - workstation  
    b1 b2 - box  
    a1 - agent  
    valve1 valve2 bolt1 bolt2 hammer1 hammer2 - content  
    valve bolt hammer - type  
  )  
  (:init  
    ; define the type of content 
    (is_type valve1 valve)  
    (is_type valve2 valve)  
    (is_type bolt1 bolt)  
    (is_type bolt2 bolt)  
    (is_type hammer1 hammer)  
    (is_type hammer2 hammer)  
 
    ; define the empty box located at central_warehouse 
    (box_at_loc b1 cw)  
    (box_at_loc b2 cw)  
    (empty_box b1)  
    (empty_box b2)  
             
    ; define content located at central_warehouse 
    (content_at_loc valve1 cw)  
    (content_at_loc valve2 cw)  
    (content_at_loc bolt1 cw)  
    (content_at_loc bolt2 cw)  
    (content_at_loc hammer1 cw)  
    (content_at_loc hammer2 cw)  
 
    ; define workstation located at central_warehouse 
    (ws_at_loc ws1 loc1)  
    (ws_at_loc ws2 loc1)  
    (ws_at_loc ws3 loc2)  
    (ws_at_loc ws4 loc2)  
    (ws_at_loc ws5 loc2) 
 
    ; define workstation located at central_warehouse 
    (connected cw loc1)  
    (connected cw loc2)  
    (connected loc1 cw)  
    (connected loc2 cw)  
 
    ; define agent located initially located at central_warehouse 
    (agent_at_loc a1 cw)  
    (empty_agent a1)
  )  
  (:goal  
    ; define goals to satisfied  
    (and  
      (content_type_at_ws bolt ws1)  
      (content_type_at_ws valve ws1)  
      (content_type_at_ws bolt ws2)  
      (content_type_at_ws hammer ws3)  
      (content_type_at_ws valve ws3)  
      (content_type_at_ws hammer ws4)  
    )  
   )  
  )

; plan
1. (pick_up cw b2 a1)
   deleted: (empty_agent a1) (box_at_loc b2 cw)
   added: (box_at_agent b2 a1)
   goals met: 0 of 6
2. (fill b2 bolt1 cw a1)
   deleted: (empty_box b2) (content_at_loc bolt1 cw)
   added: (filled_box b2 bolt1)
   goals met: 0 of 6
3. (move cw loc1 a1)
   deleted: (agent_at_loc a1 cw)
   added: (agent_at_loc a1 loc1)
   goals met: 0 of 6
4. (deliver b2 ws2 loc1 a1)
   deleted: (box_at_agent b2 a1)
   added: (empty_agent a1) (box_at_ws b2 ws2)
   goals met: 0 of 6
5. (empty b2 bolt1 bolt ws2 a1 loc1)
   deleted: (filled_box b2 bolt1) (box_at_ws b2 ws2)
   added: (empty_box b2) (box_at_loc b2 loc1) (content_type_at_ws bolt ws2)
   goals met: 1 of 6
6. (pick_up loc1 b2 a1)
   deleted: (empty_agent a1) (box_at_loc b2 loc1)
   added: (box_at_agent b2 a1)
   goals met: 1 of 6
7. (move loc1 cw a1)
   deleted: (agent_at_loc a1 loc1)
   added: (agent_at_loc a1 cw)
   goals met: 1 of 6
8. (fill b2 bolt2 cw a1)
   deleted: (empty_box b2) (content_at_loc bolt2 cw)
   added: (filled_box b2 bolt2)
   goals met: 1 of 6
9. (move cw loc1 a1)
   deleted: (agent_at_loc a1 cw)
   added: (agent_at_loc a1 loc1)
   goals met: 1 of 6
10. (deliver b2 ws1 loc1 a1)
   deleted: (box_at_agent b2 a1)
   added: (empty_agent a1) (box_at_ws b2 ws1)
   goals met: 1 of 6
11. (empty b2 bolt2 bolt ws1 a1 loc1)
   deleted: (filled_box b2 bolt2) (box_at_ws b2 ws1)
   added: (empty_box b2) (box_at_loc b2 loc1) (content_type_at_ws bolt ws1)
   goals met: 2 of 6
12. (pick_up loc1 b2 a1)
   deleted: (empty_agent a1) (box_at_loc b2 loc1)
   added: (box_at_agent b2 a1)
   goals met: 2 of 6
13. (move loc1 cw a1)
   deleted: (agent_at_loc a1 loc1)
   added: (agent_at_loc a1 cw)
   goals met: 2 of 6
14. (fill b2 valve1 cw a1)
   deleted: (empty_box b2) (content_at_loc valve1 cw)
   added: (filled_box b2 valve1)
   goals met: 2 of 6
15. (move cw loc1 a1)
   deleted: (agent_at_loc a1 cw)
   added: (agent_at_loc a1 loc1)
   goals met: 2 of 6
16. (deliver b2 ws1 loc1 a1)
   deleted: (box_at_agent b2 a1)
   added: (empty_agent a1) (box_at_ws b2 ws1)
   goals met: 2 of 6
17. (empty b2 valve1 valve ws1 a1 loc1)
   deleted: (filled_box b2 valve1) (box_at_ws b2 ws1)
   added: (empty_box b2) (box_at_loc b2 loc1) (content_type_at_ws valve ws1)
   goals met: 3 of 6
18. (move loc1 cw a1)
   deleted: (agent_at_loc a1 loc1)
   added: (agent_at_loc a1 cw)
   goals met: 3 of 6
19. (pick_up cw b1 a1)
   deleted: (empty_agent a1) (box_at_loc b1 cw)
   added: (box_at_agent b1 a1)
   goals met: 3 of 6
20. (fill b1 valve2 cw a1)
   deleted: (empty_box b1) (content_at_loc valve2 cw)
   added: (filled_box b1 valve2)
   goals met: 3 of 6
21. (move cw loc2 a1)
   deleted: (agent_at_loc a1 cw)
   added: (agent_at_loc a1 loc2)
   goals met: 3 of 6
22. (deliver b1 ws3 loc2 a1)
   deleted: (box_at_agent b1 a1)
   added: (empty_agent a1) (box_at_ws b1 ws3)
   goals met: 3 of 6
23. (empty b1 valve2 valve ws3 a1 loc2)
   deleted: (filled_box b1 valve2) (box_at_ws b1 ws3)
   added: (empty_box b1) (box_at_loc b1 loc2) (content_type_at_ws valve ws3)
   goals met: 4 of 6
24. (pick_up loc2 b1 a1)
   deleted: (empty_agent a1) (box_at_loc b1 loc2)
   added: (box_at_agent b1 a1)
   goals met: 4 of 6
25. (move loc2 cw a1)
   deleted: (agent_at_loc a1 loc2)
   added: (agent_at_loc a1 cw)
   goals met: 4 of 6
26. (fill b1 hammer1 cw a1)
   deleted: (empty_box b1) (content_at_loc hammer1 cw)
   added: (filled_box b1 hammer1)
   goals met: 4 of 6
27. (move cw loc2 a1)
   deleted: (agent_at_loc a1 cw)
   added: (agent_at_loc a1 loc2)
   goals met: 4 of 6
28. (deliver b1 ws3 loc2 a1)
   deleted: (box_at_agent b1 a1)
   added: (empty_agent a1) (box_at_ws b1 ws3)
   goals met: 4 of 6
29. (empty b1 hammer1 hammer ws3 a1 loc2)
   deleted: (filled_box b1 hammer1) (box_at_ws b1 ws3)
   added: (empty_box b1) (box_at_loc b1 loc2) (content_type_at_ws hammer ws3)
   goals met: 5 of 6
30. (pick_up loc2 b1 a1)
   deleted: (empty_agent a1) (box_at_loc b1 loc2)
   added: (box_at_agent b1 a1)
   goals met: 5 of 6
31. (move loc2 cw a1)
   deleted: (agent_at_loc a1 loc2)
   added: (agent_at_loc a1 cw)
   goals met: 5 of 6
32. (fill b1 hammer2 cw a1)
   deleted: (empty_box b1) (content_at_loc hammer2 cw)
   added: (filled_box b1 hammer2)
   goals met: 5 of 6
33. (move cw loc2 a1)
   deleted: (agent_at_loc a1 cw)
   added: (agent_at_loc a1 loc2)
   goals met: 5 of 6
34. (deliver b1 ws4 loc2 a1)
   deleted: (box_at_agent b1 a1)
   added: (empty_agent a1) (box_at_ws b1 ws4)
   goals met: 5 of 6
35. (empty b1 hammer2 hammer ws4 a1 loc2)
   deleted: (filled_box b1 hammer2) (box_at_ws b1 ws4)
   added: (empty_box b1) (box_at_loc b1 loc2) (content_type_at_ws hammer ws4)
   goals met: 6 of 6
